In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
import numpy as np
import pandas as pd
import matplotlib

print('pandas ver=',pd.__version__)
print('numpy ver={}'.format(np.__version__))
print('matplotlib ver=%s'% matplotlib.__version__)

pandas ver= 1.0.5
numpy ver=1.18.5
matplotlib ver=3.2.2

In [16]:
dir(plt)

['Annotation',
 'Arrow',
 'Artist',
 'AutoLocator',
 'Axes',
 'Button',
 'Circle',
 'Figure',
 'FigureCanvasBase',
 'FixedFormatter',
 'FixedLocator',
 'FormatStrFormatter',
 'Formatter',
 'FuncFormatter',
 'GridSpec',
 'IndexLocator',
 'Line2D',
 'LinearLocator',
 'Locator',
 'LogFormatter',
 'LogFormatterExponent',
 'LogFormatterMathtext',
 'LogLocator',
 'MaxNLocator',
 'MultipleLocator',
 'Normalize',
 'NullFormatter',
 'NullLocator',
 'Number',
 'PolarAxes',
 'Polygon',
 'Rectangle',
 'ScalarFormatter',
 'Slider',
 'Subplot',
 'SubplotTool',
 'Text',
 'TickHelper',
 'Widget',
 '_INSTALL_FIG_OBSERVER',
 '_IP_REGISTERED',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '_auto_draw_if_interactive',
 '_backend_mod',
 '_get_running_interactive_framework',
 '_interactive_bk',
 '_log',
 '_pylab_helpers',
 '_setp',
 '_setup_pyplot_info_docstrings',
 '_show',
 'acorr',
 'angle_spectrum',
 'annotate',
 'arrow',
 'autoscale',
 'autumn',
 'axes',
 'axhline',
 'axhspan',
 'axis',
 'axvline',
 'axvspan',
 'bar',
 'barbs',
 'barh',
 'bone',
 'box',
 'boxplot',
 'broken_barh',
 'cbook',
 'cla',
 'clabel',
 'clf',
 'clim',
 'close',
 'cm',
 'cohere',
 'colorbar',
 'colormaps',
 'connect',
 'contour',
 'contourf',
 'cool',
 'copper',
 'csd',
 'cycler',
 'dedent',
 'delaxes',
 'deprecated',
 'disconnect',
 'docstring',
 'draw',
 'draw_all',
 'draw_if_interactive',
 'errorbar',
 'eventplot',
 'figaspect',
 'figimage',
 'figlegend',
 'fignum_exists',
 'figtext',
 'figure',
 'fill',
 'fill_between',
 'fill_betweenx',
 'findobj',
 'flag',
 'functools',
 'gca',
 'gcf',
 'gci',
 'get',
 'get_backend',
 'get_cmap',
 'get_current_fig_manager',
 'get_figlabels',
 'get_fignums',
 'get_plot_commands',
 'get_scale_docs',
 'get_scale_names',
 'getp',
 'ginput',
 'gray',
 'grid',
 'hexbin',
 'hist',
 'hist2d',
 'hlines',
 'hot',
 'hsv',
 'importlib',
 'imread',
 'imsave',
 'imshow',
 'inferno',
 'inspect',
 'install_repl_displayhook',
 'interactive',
 'ioff',
 'ion',
 'isinteractive',
 'jet',
 'legend',
 'locator_params',
 'logging',
 'loglog',
 'magma',
 'magnitude_spectrum',
 'margins',
 'matplotlib',
 'matshow',
 'minorticks_off',
 'minorticks_on',
 'mlab',
 'new_figure_manager',
 'nipy_spectral',
 'np',
 'pause',
 'pcolor',
 'pcolormesh',
 'phase_spectrum',
 'pie',
 'pink',
 'plasma',
 'plot',
 'plot_date',
 'plotfile',
 'plotting',
 'polar',
 'prism',
 'psd',
 'quiver',
 'quiverkey',
 'rc',
 'rcParams',
 'rcParamsDefault',
 'rcParamsOrig',
 'rc_context',
 'rcdefaults',
 'rcsetup',
 're',
 'register_cmap',
 'rgrids',
 'savefig',
 'sca',
 'scatter',
 'sci',
 'semilogx',
 'semilogy',
 'set_cmap',
 'set_loglevel',
 'setp',
 'show',
 'silent_list',
 'specgram',
 'spring',
 'spy',
 'stackplot',
 'stem',
 'step',
 'streamplot',
 'style',
 'subplot',
 'subplot2grid',
 'subplot_tool',
 'subplots',
 'subplots_adjust',
 'summer',
 'suptitle',
 'switch_backend',
 'sys',
 'table',
 'text',
 'thetagrids',
 'tick_params',
 'ticklabel_format',
 'tight_layout',
 'time',
 'title',
 'tricontour',
 'tricontourf',
 'tripcolor',
 'triplot',
 'twinx',
 'twiny',
 'uninstall_repl_displayhook',
 'violinplot',
 'viridis',
 'vlines',
 'waitforbuttonpress',
 'warn_deprecated',
 'winter',
 'xcorr',
 'xkcd',
 'xlabel',
 'xlim',
 'xscale',
 'xticks',
 'ylabel',
 'ylim',
 'yscale',
 'yticks']

In [17]:
print('numpy ver=',np.__version__)

numpy ver= 1.18.5

In [23]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.081614 -0.251566  1.451277  0.109882
2013-01-02 -0.127682  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420 -1.164821  0.007921
2013-01-04 -0.634537  0.416777  1.327610 -0.004117
2013-01-05 -0.618468  0.343230 -1.049130 -1.769502
2013-01-06 -2.000075  0.948070  0.060605 -0.409456

In [35]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(['test','train','test','train']),
                  "F":'foo'})

In [27]:
df.head(3)

                   A         B         C         D
2013-01-01  1.081614 -0.251566  1.451277  0.109882
2013-01-02 -0.127682  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420 -1.164821  0.007921

In [28]:
df.tail(2)

                   A        B         C         D
2013-01-05 -0.618468  0.34323 -1.049130 -1.769502
2013-01-06 -2.000075  0.94807  0.060605 -0.409456

In [30]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [32]:
df.info

<bound method DataFrame.info of                    A         B         C         D
2013-01-01  1.081614 -0.251566  1.451277  0.109882
2013-01-02 -0.127682  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420 -1.164821  0.007921
2013-01-04 -0.634537  0.416777  1.327610 -0.004117
2013-01-05 -0.618468  0.343230 -1.049130 -1.769502
2013-01-06 -2.000075  0.948070  0.060605 -0.409456>

In [36]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.081614   -0.127682    0.992562   -0.634537   -0.618468   -2.000075
B   -0.251566    0.156689    0.815420    0.416777    0.343230    0.948070
C    1.451277    0.292302   -1.164821    1.327610   -1.049130    0.060605
D    0.109882    0.458117    0.007921   -0.004117   -1.769502   -0.409456

In [42]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.109882  1.451277 -0.251566  1.081614
2013-01-02  0.458117  0.292302  0.156689 -0.127682
2013-01-03  0.007921 -1.164821  0.815420  0.992562
2013-01-04 -0.004117  1.327610  0.416777 -0.634537
2013-01-05 -1.769502 -1.049130  0.343230 -0.618468
2013-01-06 -0.409456  0.060605  0.948070 -2.000075

In [45]:
df[['A','C']]

                   A         C
2013-01-01  1.081614  1.451277
2013-01-02 -0.127682  0.292302
2013-01-03  0.992562 -1.164821
2013-01-04 -0.634537  1.327610
2013-01-05 -0.618468 -1.049130
2013-01-06 -2.000075  0.060605

In [48]:
df.A

2013-01-01    1.081614
2013-01-02   -0.127682
2013-01-03    0.992562
2013-01-04   -0.634537
2013-01-05   -0.618468
2013-01-06   -2.000075
Freq: D, Name: A, dtype: float64

In [50]:
df[0:3]

                   A         B         C         D
2013-01-01  1.081614 -0.251566  1.451277  0.109882
2013-01-02 -0.127682  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420 -1.164821  0.007921

In [51]:
df["20130102":'20130104']

                   A         B         C         D
2013-01-02 -0.127682  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420 -1.164821  0.007921
2013-01-04 -0.634537  0.416777  1.327610 -0.004117

In [55]:
df.loc[dates[0]].values

array([ 1.08161413, -0.25156566,  1.45127688,  0.10988167])

In [61]:
#행과 열을 모두 추출
df.loc[dates[0:3],['A','B']]

                   A         B
2013-01-01  1.081614 -0.251566
2013-01-02 -0.127682  0.156689
2013-01-03  0.992562  0.815420

In [64]:
df.loc[dates[0],'A']

1.0816141326084894

In [74]:
df[0:1]

                   A         B         C         D
2013-01-01  1.081614 -0.251566  1.451277  0.109882

In [75]:
df.loc[dates[3]]

A   -0.634537
B    0.416777
C    1.327610
D   -0.004117
Name: 2013-01-04 00:00:00, dtype: float64

In [87]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.634537  0.416777
2013-01-05 -0.618468  0.343230

In [88]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.127682  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420 -1.164821  0.007921

In [90]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  1.081614 -0.251566  1.451277  0.109882
2013-01-03  0.992562  0.815420 -1.164821  0.007921

In [92]:
df[df>0]

                   A         B         C         D
2013-01-01  1.081614       NaN  1.451277  0.109882
2013-01-02       NaN  0.156689  0.292302  0.458117
2013-01-03  0.992562  0.815420       NaN  0.007921
2013-01-04       NaN  0.416777  1.327610       NaN
2013-01-05       NaN  0.343230       NaN       NaN
2013-01-06       NaN  0.948070  0.060605       NaN

In [94]:
df2=df.copy()

In [98]:
df2['E']=['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.081614 -0.251566  1.451277  0.109882    one
2013-01-02 -0.127682  0.156689  0.292302  0.458117    one
2013-01-03  0.992562  0.815420 -1.164821  0.007921    two
2013-01-04 -0.634537  0.416777  1.327610 -0.004117  three
2013-01-05 -0.618468  0.343230 -1.049130 -1.769502   four
2013-01-06 -2.000075  0.948070  0.060605 -0.409456  three

In [99]:
df2[df2['E'].isin(['two','four'])]

                   A        B         C         D     E
2013-01-03  0.992562  0.81542 -1.164821  0.007921   two
2013-01-05 -0.618468  0.34323 -1.049130 -1.769502  four

In [101]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [102]:
df["F"]=s1

In [107]:
df['D']=np.array([5]*len(df))

In [108]:
df

                   A         B         C  D    F
2013-01-01  1.081614 -0.251566  1.451277  5  NaN
2013-01-02 -0.127682  0.156689  0.292302  5  1.0
2013-01-03  0.992562  0.815420 -1.164821  5  2.0
2013-01-04 -0.634537  0.416777  1.327610  5  3.0
2013-01-05 -0.618468  0.343230 -1.049130  5  4.0
2013-01-06 -2.000075  0.948070  0.060605  5  5.0

In [112]:
df2=df.copy()
df2[df2>0]=-df
df2

                   A         B         C  D    F
2013-01-01 -1.081614 -0.251566 -1.451277 -5  NaN
2013-01-02 -0.127682 -0.156689 -0.292302 -5 -1.0
2013-01-03 -0.992562 -0.815420 -1.164821 -5 -2.0
2013-01-04 -0.634537 -0.416777 -1.327610 -5 -3.0
2013-01-05 -0.618468 -0.343230 -1.049130 -5 -4.0
2013-01-06 -2.000075 -0.948070 -0.060605 -5 -5.0

In [113]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [115]:
df

                   A         B         C  D    F
2013-01-01  1.081614 -0.251566  1.451277  5  NaN
2013-01-02 -0.127682  0.156689  0.292302  5  1.0
2013-01-03  0.992562  0.815420 -1.164821  5  2.0
2013-01-04 -0.634537  0.416777  1.327610  5  3.0
2013-01-05 -0.618468  0.343230 -1.049130  5  4.0
2013-01-06 -2.000075  0.948070  0.060605  5  5.0

In [126]:
df1.loc[dates[0]:dates[1],'E']=1
df1.loc[dates[2]:dates[3],'E']='NaN'
df1

                   A         B         C  D    F    E
2013-01-01  1.081614 -0.251566  1.451277  5  NaN    1
2013-01-02 -0.127682  0.156689  0.292302  5  1.0    1
2013-01-03  0.992562  0.815420 -1.164821  5  2.0  NaN
2013-01-04 -0.634537  0.416777  1.327610  5  3.0  NaN

In [151]:
#결측치
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.127682  0.156689  0.292302  5  1.0    1
2013-01-03  0.992562  0.815420 -1.164821  5  2.0  NaN
2013-01-04 -0.634537  0.416777  1.327610  5  3.0  NaN

In [130]:
#결측치
df1.dropna(how='all')

                   A         B         C  D    F    E
2013-01-01  1.081614 -0.251566  1.451277  5  NaN    1
2013-01-02 -0.127682  0.156689  0.292302  5  1.0    1
2013-01-03  0.992562  0.815420 -1.164821  5  2.0  NaN
2013-01-04 -0.634537  0.416777  1.327610  5  3.0  NaN

In [131]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  1.081614 -0.251566  1.451277  5  5.0    1
2013-01-02 -0.127682  0.156689  0.292302  5  1.0    1
2013-01-03  0.992562  0.815420 -1.164821  5  2.0  NaN
2013-01-04 -0.634537  0.416777  1.327610  5  3.0  NaN

In [132]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

In [136]:
df.mean()

A   -0.217764
B    0.404770
C    0.152974
D    5.000000
F    3.000000
dtype: float64

In [139]:
df.mean(1)

2013-01-01    1.820331
2013-01-02    1.264262
2013-01-03    1.528632
2013-01-04    1.821970
2013-01-05    1.535126
2013-01-06    1.801720
Freq: D, dtype: float64

In [141]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [142]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.007438 -0.184580 -2.164821  4.0  1.0
2013-01-04 -3.634537 -2.583223 -1.672390  2.0  0.0
2013-01-05 -5.618468 -4.656770 -6.049130  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [143]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  1.081614 -0.251566  1.451277   5   NaN
2013-01-02  0.953932 -0.094877  1.743579  10   1.0
2013-01-03  1.946494  0.720544  0.578758  15   3.0
2013-01-04  1.311957  1.137320  1.906368  20   6.0
2013-01-05  0.693489  1.480550  0.857238  25  10.0
2013-01-06 -1.306586  2.428620  0.917844  30  15.0

In [144]:
df

                   A         B         C  D    F
2013-01-01  1.081614 -0.251566  1.451277  5  NaN
2013-01-02 -0.127682  0.156689  0.292302  5  1.0
2013-01-03  0.992562  0.815420 -1.164821  5  2.0
2013-01-04 -0.634537  0.416777  1.327610  5  3.0
2013-01-05 -0.618468  0.343230 -1.049130  5  4.0
2013-01-06 -2.000075  0.948070  0.060605  5  5.0

In [145]:
s=pd.Series(np.random.randint(0,7,size=10))

In [146]:
s

0    2
1    3
2    5
3    2
4    1
5    4
6    6
7    1
8    5
9    0
dtype: int32

In [147]:
s.value_counts()

5    2
2    2
1    2
6    1
4    1
3    1
0    1
dtype: int64

In [149]:
s.values

array([2, 3, 5, 2, 1, 4, 6, 1, 5, 0])

In [150]:
df1.isnull().sum()

A    0
B    0
C    0
D    0
F    1
E    0
dtype: int64

In [152]:
(lambda n,m:n+m)(2,3)

5

In [157]:
lambdaX=(lambda x,y: x*y)

In [158]:
lambdaX(2,5)

10

In [159]:
(lambda n,m:n if n%2==0 else m)(5,3)

3

In [163]:
a=[1,2,3,4]
b=[11,12,13,14]
map(lambda x,y:x+y,a,b)
list(map(lambda x,y:x+y,a,b))

[12, 14, 16, 18]

In [164]:
map(a,b)

In [172]:
foo=[2,4,18,22,17,24,8,12]
list(filter(lambda x: x%3==0, foo))

[18, 24, 12]